In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [8]:
# date is bydefault object (String) we have to change it.

## Working with dates

# Converting to datetime datatype

In [9]:
date['date'] = pd.to_datetime(date['date'])

In [10]:
date.head()

        date  product_id  city_id  orders
0 2019-12-10        5628       25       3
1 2018-08-15        3646       14     157
2 2018-10-23        1859       25       1
3 2019-08-17        7292       25       1
4 2019-01-06        4344       25       3

In [11]:
# Extract year

In [18]:
date['date_year'] = date['date'].dt.year
date['date_month_no'] = date['date'].dt.month
date['date_month_name'] = date['date'].dt.month_name()
date['date_day'] = date['date'].dt.day
date['date_dow_name'] = date['date'].dt.day_name()
date['quarter'] = date['date'].dt.quarter

date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_name,date_month_no,date_day,date_dow_name,quarter
622,2018-09-21,3234,25,2,2018,September,9,21,Friday,3
788,2018-11-03,3635,16,46,2018,November,11,3,Saturday,4
402,2018-11-05,4347,25,131,2018,November,11,5,Monday,4
167,2019-07-30,5314,11,10,2019,July,7,30,Tuesday,3
689,2019-06-18,4530,26,108,2019,June,6,18,Tuesday,2

In [19]:
# OPERATIONS

In [20]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 11, 22, 23, 35, 38, 528392)

In [21]:
today - date['date']

0     1809 days 23:35:38.528392
1     2291 days 23:35:38.528392
2     2222 days 23:35:38.528392
3     1924 days 23:35:38.528392
4     2147 days 23:35:38.528392
                 ...
995   2237 days 23:35:38.528392
996   2178 days 23:35:38.528392
997   2026 days 23:35:38.528392
998   2091 days 23:35:38.528392
999   1865 days 23:35:38.528392
Name: date, Length: 1000, dtype: timedelta64[ns]

In [22]:
(today - date['date']).dt.days

0      1809
1      2291
2      2222
3      1924
4      2147
       ...
995    2237
996    2178
997    2026
998    2091
999    1865
Name: date, Length: 1000, dtype: int64

In [23]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [ ]:
# WORK WITH TIMES